aaron-bond.better-comments
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.codespaces
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
inferrinizzard.prettier-sql-vscode
kaih2o.python-resource-monitor
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
mtxr.sqltools
njpwerner.autodocstring
oderwat.indent-rainbow
piotrpalarz.vscode-gitignore-generator
pkief.material-icon-theme
redhat.vscode-yaml
ritwickdey.liveserver
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wakatime.vscode-wakatime
yzhang.markdown-all-in-one
zainchen.json
